Revit 2027 API
ParameterTypeId.RailingSystemHandrailsTypesParam Property
 "Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingSystemHandrailsTypesParam { get; }
Public Shared ReadOnly Property RailingSystemHandrailsTypesParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingSystemHandrailsTypesParam {
	ForgeTypeId^ get ();
}
static member RailingSystemHandrailsTypesParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace